# MySplunkDetectionRules #3

index=* sourcetype=WinEventLog:Security EventCode=4625
| rex field=_raw "Source Network Address:\s+(?<src_ip>\d{1,3}(?:\.\d{1,3}){3})"
| rex field=_raw "Account Domain:\s+(?<src_nt_domain>\S+)"
| eval user=replace(Account_Name, "^.*\\\\", "") 
| eval src_host=coalesce(Workstation_Name, ComputerName)
| eval Logon_Type=coalesce(Logon_Type, LogonType)
| table _time, host, Account_Name, src_ip, src_host, src_nt_domain, Logon_Type
| sort -_time
